Repository: linux-ha-japan/doc-ja
Catalog: pacemaker-1.0-crm-cli/tm/pacemaker-1.0-crm-cli-level2.tmx
Source language: en_us
Languages: ja

source: It is available both at the top level and at the `configure` level.
ja: raコマンドはCRM-CLIのトップレベルとconfigureレベルでのみ実行可能です。

source: If you need them, then use the `op` part of the `primitive` command.
ja: もし、monitorオペレーションに特殊な属性を設定したい場合はprimitiveコマンドを使用してopパラメータを編集してください。

source: Further `edit`, `show`, and `apply` commands will refer to this configuration.
ja: `edit`, `show`, `apply` の各コマンドは読み込まれたテンプレートを参照します。

source: All the commands are implemented using `cib_shadow(8)` and the `CIB_shadow` environment variable.
ja: 実行時に`cib_shadow` コマンドを呼び出しているため、環境変数`CIB_shadow`が必要となります。

source: If you've ever done a CRM style configuration, you should be able to understand the above examples without much difficulties.
ja: CRM-CLIを使ったことがなくても、上記の例は直感的に理解することができるのではないでしょうか。

source: Remove a configuration.
ja: deleteコマンドでテンプレートを削除することができます。

source: All changes are applied at one point in time, either using `commit` or when the user leaves the configure level.
ja: 変更内容がCIBに反映されるタイミングは、`commit`コマンドを実行したとき、またはconfigureレベルを抜けたときのいずれかです。

source: Example: ...............
ja: 使用例: ...............

source: Show the origin of the status section currently in use.
ja: originコマンドは実行中のクラスタで使用している設定を表示します。

source: To remove nodes, you have to specify an additional keyword `nodes`.
ja: CIBからノード情報を削除したい場合は、nodesコマンドの使用方法を参照してください。

source: There are three levels: operator, administrator, and expert.
ja: ユーザの権限は、operator, administrator, expertの3種類から選択します。

source: We begin with an informal introduction so that the reader may get acquainted with it and get a general feeling of the tool.
ja: この章では形式ばったチュートリアルではなく感覚的に理解できるような例をいくつか紹介します。

source: `crm` by default sorts CIB elements.
ja: CRM-CLIのデフォルトの設定では、CIBの要素を自動的にソートして表示します。

source: In this case the node has unexpectedly disappeared.
ja: ノードはクラスタ内でオフライン状態となります。

source: Possible values are `plain`, `color`, and 'uppercase'.
ja: 設定可能なパラメータは、plain, color, uppercase です。

source: The current internal status section with whatever modifications were performed can be saved to a file or shadow CIB.
ja: saveコマンドはstatusセクションの内容をファイルもしくはシャドウCIBへ保存します。

source: [[SEMCHK]] === Configuration semantic checks
ja: [[SEMCHK]] === 構文チェック

source: It's up to the user to make a good CRM configuration out of it.
ja: ユーザはテンプレートを利用して設定を行うことができます。

source: May be unnerving as well, in particular due to sometimes cryptic error messages.
ja: コマンドの出力するエラーメッセージがわかりづらいため、難易度は高いといえます。

source: The effect is that the node becomes a cluster member.
ja: ノードはクラスタへ参加します。

source: For obvious reasons, the CRM has no user interface with which it is possible to affect the status section.
ja: cibstatusセクションはCRMによって変更されますが、CRMはcibstatusセクションを編集するためのユーザインターフェースを提供していません。

source: The effect of those changes may then be observed by running the <<cmdhelp_configure_ptest,`ptest`>> command.
ja: 状態遷移の詳細については、<<cmdhelp_configure_ptest,`ptest`>>を参照してください。

source: Add `force` to force overwriting the existing shadow CIB.
ja: ライブCIBを既存のシャドウCIBに強制的に上書きする場合は、`force`オプションを追加してください。

source: The `cibstatus` section of the CIB keeps the current status of nodes and resources.
ja: CIBのcibstatusセクションは、実行中のノードやリソースの情報を保持しています。

source: If the resource is a group or a clone, all `target-role` attributes are removed from the children resources.
ja: リソースがgroupリソース、またはcloneリソースの場合、子リソースから`target-role`属性が削除されます。

source: Sometimes, completion may also be used to get short help on resource parameters.
ja: 入力補完はコマンドのヘルプ表示やリソースに必要なパラメータを表示するためにも使用することができます。

source: This makes the node cleanly removed from the cluster.
ja: ノードはクラスタから除外されます。

source: Choose a CIB source.
ja: 複数のシャドウCIBが存在する場合、編集対象のシャドウCIBをuseコマンドで選択することができます。

source: Refresh CIB from the LRM status.
ja: refreshコマンドはCIBに含まれるLRMの状態を更新します。

source: To make `crm` drop changes and resume use of the running cluster status, run `load live`.
ja: クラスタの状態遷移をCIBに反映するためには、`locad live`コマンドを実行してください。

source: Operations may be specified in three ways.
ja: primitiveリソースには三種類に分類することができます。

source: If they are not installed at the configuration time set this preference to `never`.
ja: もし、リソースエージェントがインストールされていない環境でCRM-CLIを実行する場合は、check-frequencyをneverに設定してください。

source: If an object to be deleted belongs to a container object, such as a group, and it is the only resource in that container, then the container is deleted as well.
ja: 他のオブジェクトに対して依存関係のある設定内容(例：groupリソースの場合はprimitiveリソースに依存関係があります)が削除された場合、依存関係にあるオブジェクトも一緒に削除されます。

source: The `view` command displays text through a pager.
ja: pagerコマンドはページャを起動します。

source: The default is `strict`.
ja: デフォルト値はstrictです。

source: Set a node to standby status.
ja: standbyコマンドはノードをスタンバイ化します。

source: The resulting CIB is run through `ptest` to show changes which would happen if the configuration is committed.
ja: ユーザ編集した情報を、実行中のクラスタに反映した場合、クラスタの状態がどのように遷移するかをptestコマンドで確認することができます。

source: It is by default set to `always`.
ja: check-frequencyのデフォルト値はalwayです。

source: The specified template is loaded into the editor.
ja: templateコマンドは特定のテンプレートをエディタへ取り込みます。

source: - are required parameters set - existence of defined parameters - timeout values for operations
ja: - 必要なパラメータが設定されているか - 定義されたパラメータが存在しているか - リソースの各オペレーション(start/stop/monitor/promote/demote)にタイムアウト値は設定されているか

source: The parameter checks are obvious and need no further explanation.
ja: パラメータ値のチェックは一般的なものなので、特に説明する必要はないでしょう。

source: Note that if the `live` status section is modified it is not going to be updated if the cluster status changes, because that would overwrite the user changes.
ja: ユーザがファイルやシャドウCIBからstatusセクションを読み込でいる状態では、クラスタの状態遷移がCIBに反映されない場合があります。ユーザの参照している領域をクラスタが上書きしてしまう可能性があるからです。

source: The configuration may be logically divided into four parts: nodes, resources, constraints, and (cluster) properties and attributes.
ja: 設定内容は「ノードの設定」「リソースの設定」「制約の設定」「属性の設定」の4種類に分類されます。

source: This short `configure` session excerpt shows how: ...............
ja: `configure`レベルでの操作例 ...............

source: Migrate a resource to a different node.
ja: migrate(move)コマンドはリソースを他のノードへ移動させます。

source: Show the current status section in the XML format.
ja: showコマンドはクラスタの状態をXML形式で表示します。

source: If there are more than two resources, then the constraint is called a resource set.
ja: 二つ以上のリソースに対して、リソース間の制約を定義することができます。

source: "Anonymous" as a simple list of "op" specifications.
ja: Anonymousリソースはオペレーションが定義されていないリソースです。

source: Too short timeout values are a common mistake in cluster configurations and, even worse, they often slip through if cluster testing was not thorough.
ja: パラメータ値が小さいために発生する不具合はよくある設定ミスの一つですが、タイムアウト値が小さすぎる場合でもクラスは正常に起動するため、不具合発生時の原因解析が困難になる場合はあります。

source: In that case, no other attributes are allowed.
ja: これ以外の属性値は他リソースの設定値を参照することはできません。

source: This is essentially a shortcut for resource stop followed by a start.
ja: このコマンドは、startコマンドをstopコマンドを連続して実行します。

source: In the `relaxed` mode all are treated as warnings.
ja: relaxedモードでは「警告」レベルで出力されます。

source: If not set, it will default to either the value of the `EDITOR` environment variable or to one of the standard UNIX editors (`vi`,`emacs`,`nano`).
ja: 特定のエディタが設定されていない場合は、環境変数EDITORもしくは標準UNIXエディタ(vi, emacsm nano)がデフォルトで設定されます。

source: This command will remove the node from the CIB and, in case the heartbeat stack is running, run hb_delnode too.
ja: このコマンドを実行すると、CIBからノードの情報が削除されます。メンバシップレイヤとしてHeartbeatを使用している場合は、内部的にhb_delnodeコマンドが実行されます。

source: Semantic check of the CIB or elements modified or created may be done in the `strict` mode or in the `relaxed` mode.
ja: CIBの情報が変更された場合、check-modeの設定に応じて構文チェックの結果が出力されます。設定値は、strict, relaxのいずれかです。

source: The colors are whatever is available in your terminal.
ja: ターミナルで利用可能な色を設定してください。

source: Remove the constraint generated by the previous migrate command.
ja: unmigrateコマンドはmigrateコマンドで作成された制約を削除します。

source: Optionally, the XML code may be displayed instead of the CLI representation.
ja: CRM-CLI形式ではなくXML形式で表示することもできます。

source: A good template should require from the user to specify only parameters.
ja: よく作りこまれたテンプレートの場合、ユーザはいくつかのパラメータ値を入力するだけでクラスタの設定を行うことができます。

source: Use this to specify your preferred editor program.
ja: 好みのエディタプログラムを指定することもできます。

source: Refresh the internal structures from the CIB.
ja: `refresh`コマンドはCIBを更新します。

source: Start a resource by setting the `target-role` attribute.
ja: startコマンドはリソースを起動します。

source: User may be assisted in the cluster configuration by templates prepared in advance.
ja: 事前に準備されたテンプレートを使用してクラスタの設定を行うことができます。

source: In normal operation, `crm` runs a command and gets back immediately to process other commands or get input from the user.
ja: CRM-CLIのデフォルトの設定では、コマンドの実行結果を待たずにプロンプトを復帰します。

source: That element can then be edited like any other.
ja: xmlコマンドを使用して、XMLの各要素を直接編集することができます。

source: If node is left out, the resource is migrated by creating a constraint which prevents it from running on the current node.
ja: 移動先のノードは引数に指定する必要がありますが、この引数が省略された場合は、リソースが現在起動しているノードに対する制約が変更されます。

source: Print differences between the current cluster configuration and the active shadow CIB.
ja: diffコマンドは現在実行されているクラスタの設定とシャドウCIBの差分を表示します。

source: The `cibadmin` is the ultimate CIB management tool: it applies chunks of XML written by the user or generated by another tool to the CIB.
ja: コマンドラインツールの一つである`cibadmin`コマンドは優れた管理ツールです。ユーザはCIB全体ではなく、CIBの一部のみを取り出して編集することができます。

source: Of course, it is always possible to edit such objects in the XML format.
ja: CRM-CLIを使わずに直接XMLを編集してCIBを変更することも当然可能ですが、この場合誤った情報がCIBに反映されてしまう可能性もあります。

source: In interactive mode dots are printed to indicate progress.
ja: 対話式モードの場合、待機時間中はプロンプトにドットが表示されます。

source: Print all resource agents' classes and, where appropriate, a list of available providers.
ja: classコマンドはリソースエージェントのclassおよびproviderを表示します。

source: It may display all objects or a set of objects.
ja: エディタを使用して設定値を編集することもできます。
